# CreatePlaceholder Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewSheet..::..CreatePlaceholder Method
ViewSheet Class See Also
---
Creates a placeholder sheet in a document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public static ViewSheet CreatePlaceholder(
	Document aDoc
)
```

Visual Basic
---
```text
Public Shared Function CreatePlaceholder ( _
	aDoc As Document _
) As ViewSheet
```

Visual C++
---
```text
public:
static ViewSheet^ CreatePlaceholder(
	Document^ aDoc
)
```

# ### Parameters
aDoc
    Type: Autodesk.Revit.DB..::..Document The document.
# ### Return Value
The placeholder sheet.
# Remarks
Placeholder sheets represent sheets stored outside of the Revit model, but which should be organized along with the Revit sheets.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ViewSheet Class
Autodesk.Revit.DB Namespace